Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Initializes an index set with a range of integers.
ja: ある範囲の整数を使ってインデックス集合を初期化します。

source: Initializes an index set with a single integer.
ja: 単一の整数を使ってインデックス集合を初期化します。

source: Initializes an interval with start and end dates set to the current date and the duration set to 0.
ja: 開始および終了日付を現在の日付に設定して期間は0に設定して、ある間隔を初期化します。

source: Initializes an interval with the specified start and end date.
ja: 指定された開始および終了日付で、ある間隔を初期化します。

source: Initializes an interval with the specified start date and duration.
ja: 指定された開始日付と期間で、ある間隔を初期化します。

source: Initializes and returns a file handle object associated with the specified file descriptor and deallocation policy.
ja: 指定されたファイル指定子およびデアロケーション方針と結び付けられたファイルハンドルを初期化して返します。

source: Initializes and returns a file handle object associated with the specified file descriptor.
ja: 指定されたファイル指定子と結び付けられたファイルハンドルを初期化して返します。

source: Initializes and returns an NSInput Stream object for reading from a given NSData object.
ja: NSInput Streamオブジェクトを、ある与えられたNSDataオブジェクトから読み出すために初期化して返します。

source: Initializes and returns an NSInput Stream object that reads data from the file at a given URL.
ja: NSInput Streamオブジェクトを初期化して返します、それは与えられたURLでファイルからデータを読み出します。

source: Initializes and returns an NSInput Stream object that reads data from the file at a given path.
ja: NSInput Streamオブジェクトを初期化して返します、それは与えられたパスでファイルからデータを読み出します。

source: Initializes the class before it receives its first message.
ja: クラスを、それがそれの最初のメッセージを受け取る前に初期化します。

source: Initializes the receiver as a directory file wrapper, with a given file-wrapper list.
ja: 与えられたファイルラッパーリストで、レシーバをディレクトリファイルラッパーとして初期化します。

source: Initializes the receiver as a regular-file file wrapper from given serialized data.
ja: 与えられたシリアライズされたデータから、レシーバを通常ファイルファイルラッパーとして初期化します。

source: Initializes the receiver as a regular-file file wrapper.
ja: レシーバを通常ファイルファイルラッパーとして初期化します。

source: Initializes the receiver as a symbolic-link file wrapper that links to a specified file.
ja: レシーバをシンボリックリンクファイルラッパーとして初期化します、それは指定されたファイルにリンクされます。

source: Initializes the receiver as a symbolic-link file wrapper.
ja: レシーバをシンボリックリンクファイルラッパーとして初期化します。

source: Initializing Date Components
ja: 日付構成要素を初期化する

source: Initializing a Class
ja: クラスの初期化

source: Initializing a Custom Unit with a Specified Symbol and Definition
ja: あつらえの単位を専門のシンボルと定義で初期化する

source: Initializing a Response Object
ja: 応答オブジェクトを初期化する

source: Initializing a Script
ja: スクリプトを初期化する

source: Initializing an Array
ja: 配列の初期化

source: Insert a range of integers into the Index Set.
ja: いくつかの整数からなるある範囲をIndex Setへと挿入します。

source: Insert an integer into the Index Set.
ja: ある整数をIndex Setへと挿入します。

source: Insert the values from the specified string into the Character Set.
ja: 指定された文字列からの値をCharacter Setに挿入します。

source: Inserting Elements
ja: いくつかの要素を挿入する

source: Inserts key (which must not be not AKey Marker) and value into table.
ja: key（それはnot AKey Markerであってはいけません）とvalueをtableに挿入します。

source: Inserts key and value into table.
ja: keyとvalueをtableへ挿入します。

source: Inserts pointer, which must not be NULL, into table.
ja: pointer、それはNULLであってはいけません、をtableへ挿入します。

source: Inserts a descriptor at the specified (one-based) position in the receiving descriptor list, replacing the existing descriptor, if any, at that position.
ja: ある記述子をレシーバである記述子リストの中の指定された位置（１起点）で挿入します、既存の記述子を、もしあれば、その位置で置き換えます。

source: Inserts a key-value pair into the specified table if the pair had not been previously added.
ja: あるキー値ペアを、もしそのペアが以前に追加されないならば、指定されたテーブルに挿入します。

source: Inserts a key-value pair into the specified table.
ja: あるキー値ペアを、指定されたテーブルに挿入します。

source: Inserts a new element into the collection at the specified position.
ja: ある新しい要素をコレクションへ指定された位置で挿入します。

source: Inserts an object at the specified index in the collection specified by the passed key.
ja: 渡されたキーによって指定されたコレクションにおいて、指定されたインデックスでオブジェクトを挿入します。

source: Inserts an object in the collection specified by the passed key.
ja: 渡されたキーによって指定されたコレクションにおいて、オブジェクトを挿入します。

source: Inserts the elements of a sequence into the collection at the specified position.
ja: あるシーケンスに属する複数の要素をコレクションへ指定された位置で挿入します。

source: Inserts the elements of another set into this option set.
ja: 別のセットの要素をこのオブションセットへと挿入します。

source: Inserts the given element into the set.
ja: 与えられた要素をセットへと挿入します。

source: Insets a rectangle by a specified amount.
ja: 指定された量だけ矩形をインセットします。

source: Installation-specific encoding.
ja: インストール特有のエンコーディング。

source: Instance Method
ja: インスタンスメソッド

source: Instance Methods
ja: インスタンス メソッド

source: Instance Properties
ja: インスタンスプロパティ

source: Instance Property
ja: インスタンスプロパティ

source: Instances of Date Formatter create string representations of NSDate objects, and convert textual representations of dates and times into NSDate objects.
ja: Date FormatterのインスタンスはNSDateオブジェクトの文字列表現を作成します、そして日付と時刻のテキスト表現をNSDateオブジェクトへと変換します。

source: Instances of the Host class represent individual hosts on a network.
ja: Hostクラスのインスタンスは、あるネットワーク上の個々のホストを表します。

source: Instances of this class are known as file wrappers.
ja: このクラスのインスタンスは、ファイルラッパーとして知られます。

source: Instances of this class represent a Boolean expression; they evaluate an object specifier and compare the resulting object to another object using a given comparison method.
ja: このクラスのインスタンスは、あるBoolean式を表します；それらはオブジェクト指定子を評価して結果として生じるオブジェクトを別のオブジェクトと与えられた比較メソッドを使って比較します。

source: Instead of observing an array, observe the to-many relationship for which the array is the collection of related objects.
ja: ある配列を監視する代わりに、その配列が関連オブジェクトのコレクションであるところの対多関係を監視してください。

source: Instead use the concat() method to add this transformation matrix to the current transformation matrix.
ja: 代わりにconcat()メソッドを使うことでこの変換行列を現在の変換行列に加えてください。

source: Instead, an object’s dealloc method is invoked by the runtime.
ja: その代わりに、オブジェクトのdeallocメソッドはランタイムによって初登されます。

source: Instead, consider using the enumerator(at: including Properties For Keys: options: error Handler:) or enumerator(at Path:) method to enumerate the directory contents yourself.
ja: 代わりに、enumerator(at: including Properties For Keys: options: error Handler:)またはenumerator(at Path:)メソッドを使ってあなた自身でディレクトリ内容を列挙することを考えてください。

source: Instead, create a new set using an array literal as its value by enclosing a comma-separated list of values in square brackets.
ja: 代わりに、新しい集合を配列リテラルをそれの値として、コンマ区切りの値のリストを角カッコで囲むことによって、作成してください。

source: Instead, this method is called when accessing an object by index using subscripting.
ja: その代わりに、このメソッドはあるオブジェクトが添え字を使うインデックスによってアクセスされる時に呼び出されます。

source: Instead, use a dispatch queue to call this method from background thread.
ja: 代わりに、ディスパッチキューを使って、このメソッドをバックグラウンドスレッドから呼び出してください。

source: Instead, you can call the url(for: in: appropriate For: create:) method, passing item Replacement Directory as the search path directory, to get a temporary URL on the destination's volume that is suitable for use with this method.
ja: 代わりに、あなたはurl(for: in: appropriate For: create:)メソッドを呼び出して、item Replacement Directoryを検索パスディレクトリとして渡して、行き先のボリューム上の一時URLを得ることができます、それはこのメソッドで使うのに適します。

source: Interact with URLs and communicate with servers using standard Internet protocols.
ja: さまざまなURLと相互作用して標準インターネットプロトコルを使ってサービスと通信します。

source: Internationalization
ja: 国際化

source: Intersects the Index Set with other.
ja: Index Setのotherとの共通部分。

source: Inverse matrices are useful for undoing the effects of a matrix.
ja: 逆の行列は、ある行列の効果をとり消すのに有用です。

source: Invert the contents of the Character Set.
ja: Character Setの内容を逆にします。

source: Inverting a Character Set
ja: ある文字集合を逆にする

source: Inverts the transformation matrix if possible.
ja: 可能ならば、変換マトリックスを反転します。

source: Invocations of read(from: options:) may change the value contained by this property, if the type of the file on disk has changed.
ja: read(from: options:)の発動は、このプロパティによって含まれる値を、ディスク上のファイルの型が変更されたならば、変更するかもしれません。

source: Invocations of read(from: options:) may change the value of this property, if the type of the file on disk has changed.
ja: read(from: options:)の発動は、このプロパティの値を、ディスク上のファイルの型が変更されたならば、変更するかもしれません。

source: Invocations of read(from: options:) may change the value of this property if the type of the file on disk has changed.
ja: read(from: options:)の発動は、このプロパティの値を、ディスク上のファイルの型が変更されたならば変更するかもしれません。

source: Invoke your implementation of string(for:) to get the non-attributed string, then create an NSAttributed String object with it (see init(string:)).
ja: string(for:)のあなたの実装を発動して属性なし文字列を得てください、それからそれを使ってNSAttributed Stringオブジェクトを作成してください（init(string:)を見てください）。

source: Invoked whenever a class or category is added to the Objective-C runtime; implement this method to perform class-specific behavior upon loading.
ja: クラスまたはカテゴリがObjective-Cランタイムに加えられる時はいつでも発動します；このメソッドを実装して、クラス特有の挙動をロードすることで実行します。

source: Invokes a method of the receiver on a new background thread.
ja: レシーバのメソッドを新しいバックグラウンドスレッド上で発動します。

source: Invokes a method of the receiver on the current thread using the default mode after a delay.
ja: レシーバのあるメソッドを現在のスレッド上で省略時のモードを使ってある猶予の後で発動します。

source: Invokes a method of the receiver on the current thread using the specified modes after a delay.
ja: レシーバのあるメソッドを現在のスレッド上で指定したモードを使ってある猶予の後で発動します。

source: Invokes a method of the receiver on the main thread using the default mode.
ja: レシーバのメソッドをメインスレッド上で省略時のモードを使って発動します。

source: Invokes a method of the receiver on the main thread using the specified modes.
ja: レシーバのメソッドをメインスレッド上で指定モードを使って発動します。

source: Invokes a method of the receiver on the specified thread using the default mode.
ja: レシーバのメソッドを指定スレッド上で省略時のモードを使って発動します。

source: Invokes a method of the receiver on the specified thread using the specified modes.
ja: レシーバのメソッドを指定スレッド上で指定モードを使って発動します。

source: Invoking this method defines a new user coordinate system whose coordinates are mapped into the former coordinate system according to the receiver’s transformation matrix.
ja: このメソッド発動は、新しいユーザ座標システムを定義します、それの座標は、レシーバの変換行列に従って、前任の座標システムへとマップされます。

source: Invoking this method is equivalent to allocating an instance of NSApple Event Descriptor and invoking init(list Descriptor:).
ja: このメソッドを発動することは、NSApple Event Descriptorのインスタンスを割り当てしてinit(list Descriptor:)を発動することと等価です。

source: Invoking this method is equivalent to allocating an instance of NSApple Event Descriptor and invoking init(record Descriptor:).
ja: このメソッドを発動することは、NSApple Event Descriptorのインスタンスを割り当てしてinit(record Descriptor:)を発動することと等価です。

source: It allows you to iterate through matches in a string, performing arbitrary actions on each as specified by the code in the Block and to stop partway through if desired.
ja: それはある文字列の中のマッチすべてに対して、それぞれにおいて「ブロック」のコードによって指定されるように任意のアクションの実行を繰り返すこと、そして希望する場合には最後までの途中で中止することををあなたに可能にします。

source: It can also be returned if the executable is a PEF/CFM executable but the current process does not support that type of executable.
ja: それはまた、実行可能ファイルがPEF/CFM実行可能ファイルである、しかし現在のプロセスはその型の実行可能ファイルをサポートしないならば返されます。

source: It can also be used to specify a duration of time, for example, 5 hours and 16 minutes.
ja: それはまたある継続時間を指定するのに使われます、例えば５時間と16分。

source: It can be read from or written to at any time.
ja: それは、いつでも読み出しまたは書き込み可能です。

source: It delegates the message by creating an NSInvocation object representing the message and sending the receiver a forward Invocation: message containing this NSInvocation object as the argument.
ja: それは、メッセージを表すNSInvocationオブジェクトを作成し、このNSInvocationオブジェクトを引数として格納するforward Invocation:メッセージをレシーバに送ることによって、メッセージを委任します。

source: It does this by calling the file Manager(_: should Copy Item At: to:) method; if that method is not implemented (or the process is running in OS X 10.5 or earlier) it calls the file Manager(_: should Copy Item At Path: to Path:) method instead.
ja: それはこれをfile Manager(_: should Copy Item At: to:)メソッドを呼び出すことによって行います； そのメソッドが実装されていない（またはプロセスがOS X 10.5以前で動作している）ならばそれはfile Manager(_: should Copy Item At Path: to Path:)メソッドを代わりに呼び出します。

source: It does this by calling the file Manager(_: should Copy Item At: to:) method; if that method is not implemented it calls the file Manager(_: should Copy Item At Path: to Path:) method instead.
ja: それはこれをfile Manager(_: should Copy Item At: to:)メソッドを呼び出すことによって行います； そのメソッドが実装されていないならばそれはfile Manager(_: should Copy Item At Path: to Path:)メソッドを代わりに呼び出します。

source: It does this by calling the file Manager(_: should Link Item At: to:) method; if that method is not implemented it calls the file Manager(_: should Link Item At Path: to Path:) method instead.
ja: それはこれをfile Manager(_: should Link Item At: to:)メソッドを呼び出すことによって行います； そのメソッドが実装されていないならばそれはfile Manager(_: should Link Item At Path: to Path:)メソッドを代わりに呼び出します。

source: It does this by calling the file Manager(_: should Move Item At: to:) method; if that method is not implemented it calls the file Manager(_: should Move Item At Path: to Path:) method instead.
ja: それはこれをfile Manager(_: should Move Item At: to:)メソッドを呼び出すことによって行います； そのメソッドが実装されていないならばそれはfile Manager(_: should Move Item At Path: to Path:)メソッドを代わりに呼び出します。

source: It does this by calling the file Manager(_: should Remove Item At:) method; if that method is not implemented (or the process is running in OS X 10.5 or earlier) it calls the file Manager(_: should Remove Item At Path:) method instead.
ja: それはこれをfile Manager(_: should Remove Item At:)メソッドを呼び出すことによって行います； そのメソッドが実装されていない（またはプロセスがOS X 10.5以前で動作している）ならばそれはfile Manager(_: should Remove Item At Path:)メソッドを代わりに呼び出します。

source: It doesn’t check to see whether the methods declared in the protocol are actually implemented—that’s the programmer’s responsibility.
ja: それは、プロトコルで宣言されるメソッドが実際に実装されるかどうか確認しません—それはプログラマーの責任です。

source: It first looks in its own information dictionary, which extracts the information encoded in the bundle’s property list (Info .plist).
ja: それはまず、それ自身の情報辞書をのぞきます、それはバンドルの持つプロパティリスト（Info .plist）の中にエンコードされる情報を抜き出します。

source: It is abbreviated as “cal.”
ja: それは “cal” のように省略されます。

source: It is also safe to share a single instance of this class from multiple threads, with the caveat that you should not change the configuration of the object while another thread is using it to generate a string.
ja: またこのクラスの単一のインスタンスを複数のスレッドから共有するのは、あなたがそのオブジェクトの構成設定を別のスレッドがそれを文字列生成のために使っている間に変更すべきでないのを警告することで、同様に安全です。

source: It is an error to store self into a new or existing live object (colloquially known as “resurrection”), which implies that this method will be called only once.
ja: selfを新しいまたは既存の生きているオブジェクトに格納すること（通称で「再生」として知られる）はエラーとなります、それはこのメソッドがただ一度だけ呼び出されることになるのを意味します。

source: It is an immutable object, initialized from a dictionary containing the cookie attributes.
ja: それは不変のオブジェクトで、クッキー属性を含んでいる辞書から初期化されます。

source: It is better to use file or memory in most cases.
ja: fileまたはmemoryを扱うのにたいていの場合により良いものです。

source: It is intended to execute user-supplied scripts and will execute them outside of the application's sandbox, if any.
ja: それはユーザ提供スクリプトを実行するよう計らい、そしてそれをアプリケーションのサンドボックスの外側で実行するでしょう、もしあれば。

source: It is more efficient to use the fast enumeration protocol (see NSFast Enumeration).
ja: より効率的なのは、高速列挙プロトコルを使うことです（NSFast Enumerationを見てください）。

source: It is not necessary to set stop to false to keep the enumeration going.
ja: 列挙し続けるためにstop to falseを設定する必要はありません。

source: It is not useful where the goal of the forwarding is to capture the NSInvocation, or manipulate the arguments or return value during the forwarding.
ja: それは、転送の目的が、NSInvocationをキャプチャすること、または転送の間に引数や戻り値に手を入れることであるところでは実用的ではありません。

source: It is possible for an NSApple Script that has been instantiated with init(contents Of: error:) to be a script for which the source code is not available but is nonetheless executable.
ja: あるNSApple Scriptでinit(contents Of: error:)でインスタンス化されたものにとって、ソースコードが利用可能でないがそれにもかかわらず実行可能であるスクリプトであるというのは可能です。

source: It is possible for an instance of NSApple Script that has been instantiated with init(contents Of: error:) to be a script for which the source code is not available, but is nonetheless executable.
ja: NSApple Scriptのインスタンスでinit(contents Of: error:)でインスタンス化されたものにとって、ソースコードが利用可能でないが、それにもかかわらず実行可能であるスクリプトであるというのは可能です。

source: It is possible for the start and end dates to be the same with a duration of 0.
ja: 開始および終了日付に対して同じであること、０の期間が可能です。

source: It is recommended that you assign a delegate to the file manager object only if you allocated and initialized the object yourself.
ja: あなたがある委任先をファイルマネージャオブジェクトに割り当てることが推奨されるのは、あなた自身でオブジェクトをアロケートして初期化した場合にのみです。

source: It is recommended that you put this item in a temporary directory as provided by the OS.
ja: あなたがこの項目をOSによって提供されるような一時ディレクトリの中に置くことは推奨されます。

source: It is recommended that you remove any temporary directories that are created after they're no longer needed.
ja: あなたが、それらがもはや必要とされなくなる後で作成されるあらゆる一時ディレクトリを除去することは推奨されます。

source: It is suitable for programming operations that require stable results not depending on the current locale.
ja: それは、現在のロケールに依存しない安定した結果を必要とするプログラミング操作に適しています。

source: It is the responsibility of the caller to ensure that no in-memory objects or data structures refer to the code being unloaded.
ja: インメモリのオブジェクトまたはデータ構造体がアンロードされるコードを参照しないことを確実にするのは呼び出し側の責任です。

source: It is used by the compiler when you use an array literal.
ja: それは、あなたが配列リテラルを使う時にコンパイラによって使われます。

source: It is used to specify a date by providing the temporal components that make up a date and time in a particular calendar: hour, minutes, seconds, day, month, year, and so on.
ja: それは、特定のカレンダーにおいて日付と時刻を作り上げる時間構成要素：時間、分、秒、日、月、年、などを提供することによってある日付を指定するのに使われます。

source: It makes the data available to observers by putting it in the user Info dictionary.
ja: それはデータを、それをuser Info辞書の中に置くことによってオブザーバに利用可能にします。

source: It may allocate new memory to replace the old, in which case it moves the contents of the old memory block to the new block, up to a maximum of size bytes.
ja: それは新しくメモリをアロケートして古いものを置き換えるかもしれません、その場合それは古いメモリブロックの内容を新しいブロックに、最大sizeバイトまで移動します

source: It may also return nil if the bundle object could not be created, so always check the return value.
ja: それはまたバンドルオブジェクトが作成されることができなかったならばnilを返します、なので常に戻り値を確認してください。

source: It may be useful to test the return value of next Date(after: matching: matching Policy: behavior: direction:) to find out if the components were obeyed or if the method had to fudge the result value due to missing time (for example, a daylight saving time transition).
ja: next Date(after: matching: matching Policy: behavior: direction:)の戻り値をテストすることは、それら構成要素が従ったかまたはメソッドが結果値を見つからない時間ででっち上げる必要がある（例えば、サマータイムの変わり目）かを見つけ出すために役立つかもしれません。

source: It never memory-maps files on external drives or network volumes, regardless of whether this option is used.
ja: それは外部デバイス上またはネットワークボリューム上のファイルを決してメモリマップしません、このオプションが使われるかどうかに関係なく。

source: It provides information about the calendar and support for calendrical computations such as determining the range of a given calendrical unit and adding units to a given absolute time.
ja: それはカレンダーについての情報を、そしてカレンダーに関する計算のサポートを提供します、例えば、与えられたカレンダー単位の範囲の決定や与えられた絶対時間にカレンダー単位を追加することなど。

source: It remains blocked until another thread signals the condition object.
ja: 別のスレッドが条件オブジェクトを合図するまで、それはブロックされたままです。

source: It removes only the local version.
ja: それはローカル版だけを除去します。

source: It succeeds if the run loop is running and in one of the specified modes; otherwise, the timer waits until the run loop is in one of those modes.
ja: 実行ループが動作していて指定されたのモードの１つならばそれはうまくいきます；そうでなければタイマーは実行ループがこれらのモードの１つになるまで待ちます。

source: It succeeds if the run loop is running and in the default mode; otherwise, the timer waits until the run loop is in the default mode.
ja: 実行ループが動作していてデフォルトのモードならばそれはうまくいきます；そうでなければタイマーは実行ループがデフォルトのモードになるまで待ちます。

source: It's far better to attempt an operation (such as loading a file or creating a directory), check for errors, and handle those errors gracefully than it is to try to figure out ahead of time whether the operation will succeed.
ja: ある操作（例えばファイルのロードまたはディレクトリの作成など）を試みて、エラーを検査して、そしてそれらのエラーを優雅に取り扱う方が、操作が成功するかどうか事前に計算しようと努力するよりずっと良いです。

source: Iterating Over Bytes
ja: バイトに対して反復する

source: Iterating Over Elements
ja: 要素すべてに対して反復する

source: Iterating over Indexes
ja: インデックスすべてに対して反復する

source: Iterating over Nodes
ja: ノードに対して反復する

source: Iteration
ja: 反復

source: Its storage policy determines whether the response should be cached on disk, in memory, or not at all.
ja: それのストレージ方針は、その応答がディスク上に、メモリ中にキャッシュされるか全くされないべきかを判定します。

source: It’s also initialized with open permissions; anyone can read or write the disk representations it saves.
ja: それはまた、開放権限で初期化されます；それが保存するディスク表現を誰もが読み書きできます。

source: It’s far better to attempt an operation (such as loading a file or creating a directory), check for errors, and handle those errors gracefully than it is to try to figure out ahead of time whether the operation will succeed.
ja: ある操作を試みて（例えばファイルのロードまたはディレクトリの作成など）、エラーを検査して、そしてそれらのエラーを優雅に取り扱う方が、操作が成功するかどうか事前に計算しようと努力するよりずっと良いです。

source: It’s not necessary to allocate and initialize an instance for the main bundle; use the main class method to get this instance.
ja: メインバンドルのためのインスタンスをアロケートして初期化する必要はありません；mainクラスメソッドを使ってこのインスタンスを得てください。

source: JSON data you send or receive from other apps, services, and files can come in many different shapes and structures.
ja: 他のアプリ、サービス、そしてファイルからあなたが受け取るまたは送るJSONデータは、多くの異なる形状や構造でやってきます。

source: Keep in mind, however, that this category will be in effect for all instances of NSArray that you use, and this might have unintended consequences.
ja: しかしながら、このカテゴリはあなたが使うNSArrayインスタンス全てに対して発効になるのを心してください、そしてこれは意図しない成り行きをもたらすかもしれません。

source: Key decoding strategies other than use Default Keys may have a noticeable performance cost because those strategies may inspect and transform each key.
ja: use Default Keys以外のキーデコーディング戦略は、顕著に性能経費がかかるかもしれません、なぜならそれら戦略は各キーを検査および変換するかもしれないからです。

source: Key encoding strategies other than use Default Keys may have a noticeable performance cost because those strategies may inspect and transform each key.
ja: use Default Keys以外のキーエンコーディング戦略は、顕著に性能経費がかかるかもしれません、なぜならそれら戦略は各キーを検査および変換するかもしれないからです。

source: Key-value dictionary of file wrappers with which to initialize the receiver.
ja: ファイルラッパーのキー値辞書、それを使ってレシーバを初期化することになります。

source: Keyed Archivers
ja: キー付きアーカイバ

source: Keys for Notification User Info Dictionary
ja: 通知User Info辞書に対するキー

source: Keys in dictionaries used with methods listed in Getting and Setting Attributes.
ja: 属性の取得と設定で一覧にされるメソッドで使用される辞書の中のキー。

source: Label numeric quantities with physical dimensions to allow locale-aware formatting and conversion between related units.
ja: 数量を物理的次元で標識化して、現地通用書式化および関連単位間の変換を可能にします。

source: Language-specific localized resources (based on the user’s language preferences)
ja: 言語特有のローカライズされたリソース（ユーザの地域環境設定に基づいて）

source: Learn how to ignore structure and data in JSON that you don’t need in your code.
ja: どのようにあなたのコードで必要としないJSONの構造とデータを無視するかを学んでください。

source: Learn how to map data from JSON keys into properties on your custom types, regardless of their names.
ja: JSONキーから、あなたのあつらえの型に関するプロパティに関連づける（マップする）方法を学んでください、それらの名前に関係なく。

source: Likewise, if n < 0, a limit that is greater than i has no effect.
ja: 同様に、n < 0ならば、iより大きい限度は効果を持ちません。

source: Likewise, if n < 0, limit should be less than i to have any effect.
ja: 同様に、n < 0ならば、limitが何らかの効果を持つにはiより少なくなければなりません。

source: Likewise, if you pass a zero-length collection as the new Elements parameter, this method removes the elements in the given subrange without replacement.
ja: 同様に、あなたがゼロ長コレクションをnew Elementsパラメータとして渡すならば、このメソッドは与えられた下位範囲の中の要素を置き換えることなく除去します。

source: Linking an Item
ja: 項目をリンクする

source: Listing 1
ja: コード出力 1

source: Listing 2
ja: コード出力 2

source: Loading Code from a Bundle
ja: バンドルからコードをロードする

source: Loading Nib Files
ja: nibファイルをロードする

source: Loads a nib from the bundle with the specified file name and owner.
ja: 指定されたファイル名と所有権を使って、あるnibファイルをバンドルからロードします。
